In [6]:
from pandas import DataFrame

In [7]:
data={'Name':['ram','ramesh','raju'],
     'Age':[20,30,40],
     'Salary':[1000,1500,3000]}

In [8]:
frame=DataFrame(data)

In [9]:
frame

     Name  Age  Salary
0     ram   20    1000
1  ramesh   30    1500
2    raju   40    3000

In [13]:
new_frame=DataFrame(data,columns=['Name','Salary','Age'])

In [14]:
new_frame

     Name  Salary  Age
0     ram    1000   20
1  ramesh    1500   30
2    raju    3000   40

In [15]:
new_frame['Salary']

0    1000
1    1500
2    3000
Name: Salary, dtype: int64

In [16]:
new_frame.ix[2]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [17]:
new_frame.loc[2]

Name      raju
Salary    3000
Age         40
Name: 2, dtype: object

In [20]:
new_frame['Profile']='Doctor','Egineer','IAS'

In [21]:
new_frame

     Name  Salary  Age  Profile
0     ram    1000   20   Doctor
1  ramesh    1500   30  Egineer
2    raju    3000   40      IAS

In [22]:
new_frame.T

              0        1     2
Name        ram   ramesh  raju
Salary     1000     1500  3000
Age          20       30    40
Profile  Doctor  Egineer   IAS

In [27]:
from pandas import Series
obj=Series([100,200,300,400,500],index=['a','d','b','c','e'])

In [28]:
obj

a    100
d    200
b    300
c    400
e    500
dtype: int64

In [29]:
obj=obj.reindex(['a','b','c','d','e'])

In [30]:
obj

a    100
b    300
c    400
d    200
e    500
dtype: int64

In [31]:
frame

     Name  Age  Salary
0     ram   20    1000
1  ramesh   30    1500
2    raju   40    3000

In [32]:
frame=frame.reindex([0,2,1])

In [33]:
frame

     Name  Age  Salary
0     ram   20    1000
2    raju   40    3000
1  ramesh   30    1500